export type HomeLink = {
  ref: string,
  name: string,
  text: string,
  rateText: string,
  rate: number,
  img: string,
}

export const homeLinks: HomeLink[] = [
  {
    ref:`https://librebook.me/puteshestvie_k_bessmertiiu`,
    name:`Веб-новелла "Путешествие к бессмертию", автор: Wang Yu (忘语), опубликована Qidian, 2008`,
    text:`Бедный и обычный мальчик из деревни присоединяется к небольшой секте в Цзян Ху и случайно становится Неофициальным Учеником. Как Хань Ли, простолюдин по происхождению, создаст для себя точку опоры в его секте? Как он, со своими посредственными способностями, сможет успешно пройти путь культивации и стать бессмертным? Эта история об обычном смертном, который, несмотря на все трудности, сразится с демонами и древними небожителями для того, чтобы найти свой собственный путь к бессмертию.`,
    rateText:`Захватывающее произведение, положившее начало великолепной вселенной культиваторов, духовных зверей и волшебных артефактов`,
    rate:5,
    img:'./rmji_novel.jpg'
  },
  {
    ref:`https://remanga.org/manga/a-record-of-a-mortals-journey-to-immortality`,
    name:`Маньхуа Путешествие к бессмертию 2020`,
    text:`Бедный и обычный мальчик из деревни присоединяется к небольшой секте в Цзян Ху и случайно становится Неофициальным Учеником. Как Хань Ли, простолюдин по происхождению, создаст для себя точку опоры в его секте? Как он, со своими посредственными способностями, сможет успешно пройти путь культивации и стать бессмертным? Эта история об обычном смертном, который, несмотря на все трудности, сразится с демонами и древними небожителями для того, чтобы найти свой собственный путь к бессмертию.`,
    rateText:`Формат не может передать всю глубину описанного в веб-новелле мира`,
    rate:3,
    img:'./rmji_manhua.jpg'
  },
  {
    ref:`https://amedia.site/704-puteshestvie-k-bessmertiyu.html`,
    name:`Аниме "Путешествие к бессмертию", Студия Original ForceWan Wei Mao Donghua 2020-2024`,
    text:`Чего стоит отыскать свой путь к вечной жизни? Вот юноша Хань Ли задался этим вопросом и пытается найти источник бессмертия. Началось все с того, Хань Ли случайным образом попадает в загадочную секту и становится участником. Очень сильно мешает стать кем-то важным в этой секте его происхождение - он простолюдин.
    Да и к тому же есть еще одна проблема – он не обладает хорошими способностями, чтобы сражаться и идти по головам соучастников секты и врагов. Но он не собирается сдаваться и будет закалять себя и искать способ стать бессмертным. На его пути встретятся демоны, небесные существа и многие другие обитатели мира. История показывает тяжелую жизнь и путь самого просто мальчика до бессмертного существа.`,
    rateText:`Теперь мы сможем увидеть любымых героев веб-новеллы`,
    rate:5,
    img:'./rmji_anime.jpg'
  },
]
